app/controllers/card_wallets_controller.rb

	def update_limit
	  	card_wallet_assistance = CardWalletAssistance.instance()
	  	result = card_wallet_assistance.update_limit(params['Limite'], request.headers["HTTP_AUTH_TOKEN"])
---
UPDATE "card_wallets" SET "limit" = ?, "updated_at" = ? WHERE "card_wallets"."id" = ?  [["limit", "1.99"], ["updated_at", "2017-12-12 22:44:11.981102"], ["id", 3]]