app/controllers/credit_cards_controller.rb

	def update_card
		#recupera o JSON enviado no corpo da requisicao
	  	card = JSON.parse(request.raw_post)

	  	#recupera a instancia da classe de assistencia para o escopo de cartoes de credito
	  	ccard_assistance = CreditCardAssistance.instance()

		render json: ccard_assistance.update_card(card), status: 200
---
UPDATE "credit_cards" SET "print_name" = ?, "expire_month" = ?, "updated_at" = ? WHERE "credit_cards"."id" = ?  [["print_name", "ZUGOR THE BEAST BUTCHER"], ["expire_month", nil], ["updated_at", "2017-12-03 02:04:31.115869"], ["id", 55]]