app/controllers/users_controller.rb

	def update_user
		#recupera o JSON enviado no corpo da requisicao
	  	user = JSON.parse(request.raw_post)

	  	#recupera a instancia da classe de assistencia para o escopo de usuario
	  	user_assistance = UserAssistance.instance()

		render json: user_assistance.update_user(user), status: 200
---
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "OberdanAra"], ["updated_at", "2017-12-10 00:30:58.450529"], ["id", 3]]